# Brewfile
# Wile-E-Coyote-lab macOS Environment Standard Packages

# --- 1. Core Command Line Tools (Formulae) ---
brew "git"                    # Essential version control
brew "wget"                   # Retrieve files from the web
brew "curl"                   # Enhanced version of curl (often needed for scripting)
brew "jq"                     # JSON processor (used in API and token parsing)
brew "yq"                     # YAML processor (used in GHA workflows)
brew "tree"                   # Directory visualization
brew "htop"                   # Process viewer
brew "gnu-sed"                # Portable sed (used in extract_code_from_url.sh)
brew "zsh-autosuggestions"    # Zsh plugin support

# --- 2. Programming Languages/Runtimes ---
brew "node"                   # Node.js runtime
brew "python@3.11"            # Stable Python 3 (explicit version for listener.py)
brew "pipx"                   # Isolated Python CLI tool management

# --- 3. GitHub CLI Integration ---
brew "gh"                     # GitHub CLI (used in exportcode.sh and session.sh)

# --- 4. GUI Applications (Casks) ---
cask "google-chrome"
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "slack"

# --- 5. Fonts (Optional but Recommended) ---
# cask "font-jetbrains-mono"
